; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; grid cells and geometry
    (place ?x)
    (left ?x ?y)
    (below ?x ?y)

    ; shapes
    (objshape ?s)

    ; locked/open cells
    ; (locked cells can be later opened with key of matching lock shape)
    (open ?x)
    (locked ?x)
    (lock_shape ?x ?s)

    ; keys and shapes
    (key ?k)
    (at ?k ?x)
    (key_shape ?k ?s)

    ; robot
    (at_robot ?x)
    (holding ?k)
    (arm_empty)
  )

  ; move along unlocked cells
  (:action move_left
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (left ?nextpos ?curpos) 
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_right
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (left ?curpos ?nextpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_up
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (below ?curpos ?nextpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_down
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (below ?nextpos ?curpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  ; pickup/putdown keys
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos) (key ?key)
                       (at_robot ?curpos) (at ?key ?curpos) (arm_empty))
    :effect (and (holding ?key) (not (at ?key ?curpos)) (not (arm_empty))))

  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos) (key ?key)
                       (at_robot ?curpos) (holding ?key))
    :effect (and (arm_empty) (at ?key ?curpos) (not (holding ?key))))

  ; unlock cells with right key
  (:action unlock_from_below
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (below ?curpos ?lockpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_above
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (below ?lockpos ?curpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_left
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (left ?curpos ?lockpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_right
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (left ?lockpos ?curpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))
)

; problem
(define (problem grid_4room2_fpl_s3_seed5974_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18)
    (objshape shape0) (objshape shape1) (objshape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p3) (open p4) (open p5) (open p6) (open p7) (open p8) (open p11) (open p12) (open p13) (open p14) (open p15) (open p16) (open p17) (open p18)
    (locked p2) (locked p9) (locked p10)
    ; Left/below relations
    (left p1 p0)
    (left p2 p1)
    (left p3 p2)
    (left p4 p3)
    (left p6 p5)
    (left p8 p7)
    (left p12 p11)
    (left p14 p13)
    (left p16 p15)
    (left p18 p17)
    (below p0 p5)
    (below p1 p6)
    (below p3 p7)
    (below p4 p8)
    (below p5 p9)
    (below p7 p10)
    (below p9 p11)
    (below p10 p13)
    (below p11 p15)
    (below p12 p16)
    (below p13 p17)
    (below p14 p18)
    ; Lock and key shapes
    (lock_shape p9 shape1)
    (lock_shape p2 shape1)
    (lock_shape p10 shape0)
    (key_shape key0 shape0)
    (key_shape key1 shape1)
    (key_shape key2 shape2)
    ; Key placement
    (at key0 p3)
    (at key1 p5)
    (at key2 p12)
    ; Robot placement
    (at_robot p1)
    (arm_empty)
  )
  (:goal (at_robot p13))
)

; plan
1. (move_right p1 p0)
   deleted: (at_robot p1)
   added: (at_robot p0)
   goals met: 0 of 1
2. (move_up p0 p5)
   deleted: (at_robot p0)
   added: (at_robot p5)
   goals met: 0 of 1
3. (pickup p5 key1)
   deleted: (at key1 p5) (arm_empty)
   added: (holding key1)
   goals met: 0 of 1
4. (move_left p5 p6)
   deleted: (at_robot p5)
   added: (at_robot p6)
   goals met: 0 of 1
5. (move_down p6 p1)
   deleted: (at_robot p6)
   added: (at_robot p1)
   goals met: 0 of 1
6. (unlock_from_right p1 p2 key1 shape1)
   deleted: (locked p2)
   added: (open p2)
   goals met: 0 of 1
7. (move_left p1 p2)
   deleted: (at_robot p1)
   added: (at_robot p2)
   goals met: 0 of 1
8. (move_left p2 p3)
   deleted: (at_robot p2)
   added: (at_robot p3)
   goals met: 0 of 1
9. (putdown p3 key1)
   deleted: (holding key1)
   added: (arm_empty) (at key1 p3)
   goals met: 0 of 1
10. (pickup p3 key0)
   deleted: (at key0 p3) (arm_empty)
   added: (holding key0)
   goals met: 0 of 1
11. (move_up p3 p7)
   deleted: (at_robot p3)
   added: (at_robot p7)
   goals met: 0 of 1
12. (unlock_from_below p7 p10 key0 shape0)
   deleted: (locked p10)
   added: (open p10)
   goals met: 0 of 1
13. (move_up p7 p10)
   deleted: (at_robot p7)
   added: (at_robot p10)
   goals met: 0 of 1
14. (move_up p10 p13)
   deleted: (at_robot p10)
   added: (at_robot p13)
   goals met: 1 of 1
